Examinator/src/Catalogs/УчебныеМатериалыСУО/УчебныеМатериалыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеМатериалыСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Хранение</name>
    <type>
      <types>DefinedType.УчебныйМатериалСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыУчебныхМатериаловСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Размещение</name>
    <type>
      <types>EnumRef.РазмещениеУчебныхМатериаловСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/РазмещениеУчебныхМатериаловСУО/РазмещениеУчебныхМатериаловСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазмещениеУчебныхМатериаловСУО</name>
  <enumValues>
    <name>БиблиотекаЭлектронногоОбучения</name>
  </enumValues>
  <enumValues>
    <name>КонструкторКурсов</name>
  </enumValues>
  <enumValues>
    <name>КорпоративныйУниверситет</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхКурсов/ТипыЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхКурсов</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Учебник</name>
  </enumValues>
  <enumValues>
    <name>Слайдовый</name>
  </enumValues>
  <enumValues>
    <name>SCORM</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыУчебныхМатериаловСУО/ТипыУчебныхМатериаловСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУчебныхМатериаловСУО</name>
  <enumValues>
    <name>ЗаданиеНаПроверку</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйУчебник</name>
  </enumValues>
  <enumValues>
    <name>СлайдовыйКурс</name>
  </enumValues>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/УчебныеМатериалыСУО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
		
		Хранение = ДанныеЗаполнения;
		
		ДанныеЭлектронногоКурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			Новый Структура("Тип, ДатаИзменения, Наименование", "Тип", "ДатаИзменения", "Наименование"));
			
		Наименование = ДанныеЭлектронногоКурса.Наименование;
		ДатаИзменения = ДанныеЭлектронногоКурса.ДатаИзменения;
		Размещение = Перечисления.РазмещениеУчебныхМатериаловСУО.БиблиотекаЭлектронногоОбучения;
				
		Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.SCORM Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.Другое;
		КонецЕсли;
		
		Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Слайдовый Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.СлайдовыйКурс;
		КонецЕсли;
		
		Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Тест Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.Тест;
		КонецЕсли;
		
		Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Учебник Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.ЭлектронныйУчебник;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
		
		Хранение = ДанныеЗаполнения;
		
		ДанныеЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			Новый Структура("Наименование, ДатаИзменения", "Наименование", "ДатаИзменения"));
		Размещение = Перечисления.РазмещениеУчебныхМатериаловСУО.КорпоративныйУниверситет;
		Тип = Перечисления.ТипыУчебныхМатериаловСУО.ЗаданиеНаПроверку;
		Наименование = ДанныеЗадания.Наименование;
		ДатаИзменения = ДанныеЗадания.ДатаИзменения;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		Хранение = ДанныеЗаполнения;
		
		ДанныеСводаЗнаний = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			Новый Структура("Тип, ДатаИзменения, Наименование", "Тип", "ДатаИзменения", "Наименование"));
		
		Если ДанныеСводаЗнаний.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.ЭлектронныйУчебник;
		КонецЕсли;
		
		Если ДанныеСводаЗнаний.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.Тест;
		КонецЕсли;		
		
		Если ДанныеСводаЗнаний.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ПустаяСсылка() Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.Другое;
		КонецЕсли;
		
		Размещение = Перечисления.РазмещениеУчебныхМатериаловСУО.КонструкторКурсов;
		Наименование = ДанныеСводаЗнаний.Наименование;
		ДатаИзменения = ДанныеСводаЗнаний.ДатаИзменения;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;	
	
	СвойстваЭлементаВБазе = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления");
	ДополнительныеСвойства.Вставить("СтараяПометкаУдаления", СвойстваЭлементаВБазе.ПометкаУдаления);	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("СтараяПометкаУдаления")
		И ДополнительныеСвойства.СтараяПометкаУдаления <> ПометкаУдаления Тогда		
		Если ТипЗнч(Хранение) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
			РазработкаЭлектронныхКурсов.УстановитьПометкуУдаленияЭлектронногоКурса(Хранение, ПометкаУдаления); // Помечаем на удаление электронный курс
		Иначе
			РазмещениеОбъект = Хранение.ПолучитьОбъект();
			РазмещениеОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
